example_pimpleFoamYade/0/uSource
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      uSource;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    y0
    {
        type            calculated;
        value           uniform (0 0 0);
    }


    y1
    {
        type            calculated;
        value           uniform (0 0 0);
    }


    x0 
    {
        type            cyclic;
    
    }




    x1 
    {
        type            cyclic;
    
    }


    z1 
    {
        type            cyclic;
    
    }



    z0 
    {
        type            cyclic;
    
    }

}

// ************************************************************************* //
